Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: The number of OCSP responses MUST NOT exceed the number of certificates.
ja: OCSP 応答の数は, 証明書の数を越えてはならない.

source: Additionally, some channels can transfer several types of data.
ja: 加えて, いくつかのデータの種類を転送するチャンネルがある.

source: This document describes the following new methods:
ja: この文書は, 次の新しい方法を定義する:

source: The client MAY at any time continue with a new SSH_MSG_USERAUTH_REQUEST message, in which case the server MUST abandon the previous authentication attempt and continue with the new one.
ja: クライアントは， いつでも 新しい SSH_MSG_USERAUTH_REQUEST を送ってよい． この時， サーバはこれまでの認証の試行を放棄し新しいもので継続しなければならない．

source: This document is concerned with SSH implementation details; specification of the underlying cryptographic algorithms is left to other standards documents.
ja: この文書は, SSHの実装の詳細に関係している. 基底の暗号アルゴリズムの仕様は, 他の標準文書に任されている.

source: For localization purposes, the protocol attempts to minimize the number of textual messages transmitted.
ja: 地域化の目的のために , プロトコルは転送されるテキストメッセージの数を最小にするようにしている.

source: The only time the server should send multiple request messages is if additional authentication data
ja: 追加の認証データが必要な場合のみ, サーバは複数の要求メッセージを送る必要がある.

source: Conversely, if AES-GCM is selected as the MAC algorithm, it MUST also be selected as the encryption algorithm.
ja: 逆に, AES-GCM が MAC アルゴリズムとして選択されたら, 暗号化アルゴリズムとしても選択されなければならない.

source: The security implications of using SSH are covered in [RFC4251].
ja: SSH の利用におけるセキュリティに関する考察は, [RFC4251] で説明されている.

source: Signature Algorithm .................................5 3.1.2.
ja: 署名アルゴリズム .................................5 3.1.2.

source: The client responds with:
ja: クライアントは以下で応答する:

source: o The authentication methods that are to be required by the server for each user.
ja: o サーバがそれぞれのユーザに要求する認証法

source: Additionally, support is provided for Elliptic Curve Menezes-Qu- Vanstone (ECMQV).
ja: さらに, 楕円曲線 Menezes-Qu-Vanstone (ECMQV) のサポートを提供する.

source: Connection Protocol Assigned Names
ja: コネクションプロトコルに割り当てられる名前

source: o in the SSH_MSG_KEX_ECDH_REPLY message [RFC5656]
ja: o SSH_MSG_KEX_ECDH_REPLY メッセージ内 [RFC5656]

source: Attributes are used to define properties or restrictions for public keys.
ja: 属性は, 公開鍵の性質や制限を定義するのに用いられる.

source: Suite B and Secure Shell
ja: Suite B とセキュアシェル

source: The first is where an attacker places a device between the client and the server before the session is initiated.
ja: 1つ目は, セッション開始前にクライアントとサーバの間に攻撃者がデバイスを置いた場合だ.

source: In times of network stress, the transport protocol and its underlying security mechanisms SHOULD NOT depend upon the ready availability of other network services (e.g., Network Time Protocol (NTP) or AAA protocols).
ja: ネットワークに負荷がかかっている時に, トランスポートプロトコルとその基底のセキュリティメカニズムは, (例えば ネットワークタイムプロトコル (NTP) や AAA プロトコルのような)他のネットワークサービスがすぐに利用できるかどうかに依存しないほうがよい.

source: Implementations SHOULD generate public key files using their system's local text file representation.
ja: システムのローカルなテキストファイル表現を用いて公開鍵を実装は生成する必要がある.

source: The table in Section 1 gives an estimate of the equivalence between elliptic curve field size and symmetric key size.
ja: 1 節の表は, 楕円曲線フィールドサイズと対称鍵サイズの等しさの見積りだ.

source: If the threshold is exceeded, the server SHOULD disconnect.
ja: この閾値を越えた場合, サーバは切断する必要がある.

source: All authentication requests MUST use the following message format.
ja: すべての認証の要求は, 次のメッセージの形式を利用しなければならない.

source: MAC Algorithm Names
ja: MACアルゴリズム名

source: The "blowfish-cbc" cipher is Blowfish in CBC mode, with 128-bit keys [SCHNEIER].
ja: "blowfish-cbc" 暗号は CBCモードでの Blowfish で, 128-bit の鍵を使う [SCHNEIER].

source: During the transition period, it is important to be able to work in a
ja: 移行期間では, プロトコルのより古いバージョンを利用するインストール済みの SSH のクライアントやサーバと互換する方法で動作できることが重要だ.

source: Local Security Policy
ja: ローカルなセキュリティポリシー

source: Framing Protocol .
ja: フレーミングプロトコル .

source: o There is no Cyclic Redundancy Check (CRC) at the end of the base64-encoded block.
ja: o base64 エンコードされたブロックの終わりに 巡回冗長検索 (CRC)がない.

source: The comment field is useful so the user can identify the key without resorting to comparing its fingerprint.
ja: comment は, 指紋の比較を頼らずにユーザが鍵を特定するのに有効だ.

source: It then calls GSS_GetMIC() to obtain a GSS-API message integrity code for H. S then sends f and the message integrity code (MIC) to C.
ja: Hに対する GSS-API メッセージ完全性コードを得るために GSS_GetMIC() を呼ぶ. そして S は Cに f と メッセージ完全性コード(MIC)を送る.

source: This step is performed only (1) if the server's final call to GSS_Accept_sec_context() produced a non-zero-length final reply token to be sent to the client and (2) if no previous call by the client to GSS_Init_sec_context() has resulted in a major_status of GSS_S_COMPLETE.
ja: (1) サーバの最後の GSS_Accept_sec_context() 呼び出しが, クライアントに送られる0でない最終応答トークンを生成し, (2) クライアントの GSS_Init_sec_context() のそれまでの呼び出しが major_status が GSS_S_COMPLETE である結果を生成しなかった場合にのみ, このステップは実行される.

source: The server SHOULD make a log entry regarding this.
ja: サーバは, これに関するログを残す必要がある.

source: This means that an adversary may be able to convince the receiver to accept the same message more than once or to accept messages out of order.
ja: 同じメッセージを1回より多く受け取ったり順番がおかしいメッセージを受け取るのを受信者に納得させることが攻撃者ができる, ということを意味する.

source: The 'public host key and certificates for client host' may include certificates.
ja: 'public host key and certificates for client host' は 証明書を含むかもしれない.

source: Security Properties ........................................7 4.5.
ja: セキュリティの特性 ........................................7 4.5.

source: signature algorithm and ECDH is used as the key exchange method, if curves of different sizes are used, then it is possible that different hash functions from the SHA2 family could be used.
ja: 特に, ECDSAを署名アルゴリズムとしてかつECDHを鍵交換法として利用する際, 異なるサイズの曲線を利用していると, SHA2ファミリの異なるハッシュ関数が利用される可能性があることに注意.

source: Select a random (k-1)-bit prime q, so that q mod 12 = 5.
ja: ランダムな (k-1)-bit の素数 q を選択. このとき q mod 12 = 5.

source: If the server does understand the 'channel type', but the channel still fails to open, then the server SHOULD respond with a locally assigned 'reason code' value that is consistent with the proposed local 'channel type'.
ja: サーバが 'channel type' を理解するがチャンネルの開始に失敗するなら, サーバは提案されたローカルな 'channel type' に対応するローカルに割り当てられた値を返す必要がある.

source: Additional manageability considerations are listed below.
ja: 追加の管理の上での考慮を以下に挙げる.

source: Error Token
ja: エラートークン

source: DNS names are used to create local namespaces where experimental or classified extensions can be defined without fear of conflicts with other implementations.
ja: DNS名は, 他の実装との衝突の恐れなしに, 実験的あるいは機密扱いの拡張を定義するローカルな名前空間として利用される.

source: The server can constantly compute new groups in the background.
ja: サーバはバックグラウンドで常に新しい群を計算できる.

source: Global Requests
ja: 全体的な要求

source: The encrypted data in all packets sent in one direction SHOULD be considered a single data stream.
ja: ある通信の方向で送られるすべてのパケットの暗号化済みのデータは, 単一のデータストリームとみなされる必要がある.

source: The 'address to bind' and 'port number to bind' specify the IP address (or domain name) and port on which connections for forwarding are to be accepted.
ja: 'address to bind' と 'port number to bind' は, 転送のための接続が受け入れる IPアドレス(ないしドメイン名) とポートを指定する.

source: The language tag is deprecated and SHOULD be the empty string.
ja: language tag は推奨されておらず、空の文字列である必要がある.

source: Unlike the ECDH key exchange method, ECMQV relies on a public key algorithm that uses ECC keys: it does not need a family of method names because the curve information can be gained from the public key algorithm.
ja: ECDH 鍵交換とは異なり, ECMQV は楕円曲線鍵を用いる公開鍵アルゴリズムに依存している: 方法の名前のファミリは必要ない. 曲線の情報は公開鍵アルゴリズムから入手できる.

source: While there is usually little point for clients to send requests that the server does not list as acceptable, sending such requests is not an error, and the server SHOULD simply reject requests that it does not recognize.
ja: クライアントが, サーバが受け入れるリストに挙げていない要求を送るのは通常意味がないが, そのような要求を送ることはエラーではない. サーバは, そのような要求は認められないので, 単純に拒否する必要がある.

source: Public Key Fingerprints
ja: 公開鍵の指紋

source: The server keeps a list of safe primes and corresponding generators that it can select from.
ja: サーバは, サーバが選択できる安全な素数のリストと対応する生成器を保持する.

source: For example: the US-ASCII string "testing" is represented as 00 00 00 07 t e s t i n g.
ja: 例: US-ASCIIのstring "testing" は 00 00 00 07 t e s t i n g として表現される.

source: Masquerade - SSH provides for verification of the identity of the SSH server and the identity of the SSH client.
ja: なりしまし - SSH は, SSH サーバ/クライアントの識別情報の確認を提供する.

source: Names of this format are only valid if they are first registered with the IANA.
ja: このフォーマットでの名前は, IANAによって最初に登録されたものだけが有効だ.

source: Also note that the insertion of variable amounts of 'random padding' may help thwart traffic analysis.
ja: さらに, 可変の 'random padding'の挿入がトラフィック解析の防止に役立つことに注意.

source: Implementers should note the importance of entropy and the well-meant, anecdotal warning about the difficulty in properly implementing pseudo-random number generating functions.
ja: 実装者は, エントロピーの重要性を注記する必要がある. また, 疑似乱数生成関数の正しい実装の難しさをわかりやすく事例付きで警告する必要がある.

source: For the most part, the security considerations involved in using the Secure Shell protocol apply.
ja: セキュアシェルプロトコル利用上のセキュリティの考察が大部分適用される.

source: Language tags SHOULD NOT be present unless they are known to be needed by the sending party.
ja: 送り手側で必要だとされていなければ, 言語タグは存在しないほうがよい.

source: The server SHOULD include this user authentication method in the list of methods that can continue (in an SSH_MSG_USERAUTH_FAILURE) if the initial key exchange was performed using a GSS-API-based key exchange method and provides information about the user's identity that is useful to the server.
ja: GSS-API ベースの鍵交換法を用いて最初の鍵交換が行なわれ, 鍵交換によりユーザの識別情報がサーバで利用可能である場合, (SSH_MSG_USERAUTH_FAILURE での) 継続可能な認証法リストに このユーザ認証法を含める必要がある.

source: The contents of the MIC field are obtained by calling GSS_GetMIC over the following, using the GSS-API context that was established during initial key exchange:
ja: MIC フィールドの内容は, 確立した GSS-API コンテキストを利用して 以下に対して GSS_GetMIC を呼び出すことで得られる.

source: Although the example shows the server sending a <hello> message followed by the client's message, both sides will send the message as soon as the NETCONF subsystem is initialized, perhaps simultaneously.
ja: 例では <hello> メッセージのサーバの送信に続いてクライアントのメッセージが続いているが, NETCONF サブシステムが開始されたらすぐに, おそらく同時に, どちらの側からもメッセージが送られる.

source: Ordering of Key Exchange Methods ...................20 9.3.9.
ja: 鍵交換法の注文 ...................20 9.3.9.

source: As a result, servers SHOULD use each RSA key for as few key exchanges as possible.
ja: このため, サーバは可能な限り少ない鍵交換に対してそれぞれの RSA 鍵を用いる必要がある.

source: For all three classes of functionality added by this document (the public key algorithms involving ECDSA, key exchange involving ECDH, and authenticated key exchange involving ECMQV), the current best known technique for breaking the cryptosystems is by solving the elliptic curve discrete logarithm problem (ECDLP).
ja: この文書で追加された3つのクラス(ECDSAに関連する公開鍵アルゴリズムと, ECDHに関連する鍵交換, ECMQVに関連する認証付き鍵交換)のすべてについて, 暗号系を破る現在もっともよく知られた技術は, 楕円曲線離散対数問題(ECDLP)を解くことだ.

source: Implementations SHOULD support longer packets, where they might be needed.
ja: 実装は, 必要がある場合はより長いパケットをサポートする必要がある.

source: The program may be a shell, an application, a system command, or some built-in subsystem.
ja: このプログラムは, シェルやアプリケーションやシステムのコマンドや組み込まれたサブシステムだ.

source: Either party may send any of the following messages at any time.
ja: どちらの側も, 任意の時点で次のメッセージのどれかを送ってもよい.

source: Future Assignments .................................10 4.5.
ja: 将来の割り当て.................................10 4.5.

source: Introduction
ja: イントロダクション

source: Closing a Session
ja: セッションの終了

source: An important characteristic of this is that authorization is done prior to determining if the connection can succeed.
ja: 接続が成功するかを決定するより前に, 認可が終わるのがこれの重要な特性だ.

source: The downside is that the database of name-to-key associations may become burdensome to maintain.
ja: 名前と鍵との関連のデータベースを管理するのがやっかいになるかもしれないのが, このやり方の欠点だ.

source: If either the client's call to GSS_Init_sec_context() or the server's call to GSS_Accept_sec_context() returns an error status and produces an output token (called an "error token"), then the following SHOULD be sent to convey the error information to the peer:
ja: GSS_Init_sec_context() のクライアントでの呼び出しか GSS_Accept_sec_context() のサーバでの呼び出しでエラー状態が返され, ("エラートークン"と呼ばれる) 出力トークンが生成されたら, 相手側にエラー情報を伝えるために次を送る必要がある.

source: The Version Packet
ja: バージョンパケット

source: If no guessed packet will be sent, this MUST be FALSE.
ja: 推測したパケットが送られないなら, これは, FALSE でなければならない.

source: Connection Protocol Channel Request Names ..........15 4.9.4.
ja: コネクションプロトコルのチャンネルのリクエスト名.......15 4.9.4.

source: Verify received key is valid.
ja: 受信した鍵の検証が成功

source: Signature Encoding
ja: 署名のエンコーディング

source: Digital Signatures and Certificates
ja: 電子署名と証明書

source: However, to date no two implementations use the same mechanism to configure a public key for use.
ja: しかし, 公開鍵の利用の設定で, 別々の実装で同じメカニズムを利用する例は今のところない.

source: Any necessary additional SSH-specific parameters should be provided in an implementation-dependent manner.
ja: 実装依存の方法で, 必要な追加のSSH特有のパラメータも提供される必要がある.

source: The Break Request ...............................................3 4.
ja: Break 要求 ...............................................3 4.

source: Clients that do not validate the DNSSEC signatures themselves MUST use a secure transport (e.g., TSIG [9], SIG(0) [10], or IPsec [8]) between themselves and the entity performing the signature validation.
ja: DNSSEC の署名を自らは検証しないクライアントは, 署名の検証を行なうエンティティとの間に安全なトランスポート(例えば TSIG [9] や SIG(0) [10], IPsec [8])を使わなければならない.

source: The generator g should be chosen such that the order of the generated subgroup does not factor into small primes; that is, with p = 2q + 1, the order has to be either q or p - 1.
ja: 生成器 g は生成される部分群のオーダーが小さい素数に因数分解できないように選ぶ必要がある. つまり p = 2q + 1 のとき, オーダーは q か p-1 のどちらかでなければならない.

source: Service providers SHOULD include the DNS-ID identifier type in certificate requests.
ja: サービスプロバイダは, 証明書の要求で DNS-ID 識別子型を含む必要がある.

source: Multiple entries MAY be specified.
ja: 複数のエントリが指定されてもよい.

source: o The SSH public key algorithm "x509v3-ssh-dss".
ja: o SSH 公開鍵アルゴリズム "x509v3-ssh-dss".

source: Modularity
ja: モジュール

source: The SSH server may send an SSH_MSG_USERAUTH_BANNER message at any time after this authentication protocol starts and before authentication is successful.
ja: SSHのサーバも, 認証プロトコルが開始してから認証が完了するまでのいつでも, SSH_MSG_USERAUTH_BANNER メッセージを送信できる.

source: The SSH user authentication method name "external-keyx" is to be reserved, in order to avoid conflicts with implementations supporting an earlier version of this specification.
ja: SSH ユーザ認証法名 "external-keyx" は予約される. この実装の以前のバージョンをサポートする実装との衝突を避けるためだ.

source: o in the SSH_MSG_USERAUTH_REQUEST message when "hostbased" authentication is used [RFC4252]
ja: o "hostbased" 認証が用いられる SSH_MSG_USERAUTH_REQUEST メッセージ内 [RFC4252]

source: Informational References ........................................7 8.
ja: 情報のリファレンス ........................................7 8.

source: Security Mechanism Negotiation and Initialization
ja: セキュリティメカニズムの交渉と初期化

source: Algorithm and Method Naming
ja: アルゴリズムと方式の命名規則

source: So, given this definition of PFS, SSH does have PFS.
ja: よって, PFSの定義から, SSHはPFSという性質を持っている.

source: The least significant bit of the private exponent can be recovered when the modulus is a safe prime [MENEZES].
ja: プライベート指数の最下位ビットは, 法が安全な素数の時に回復できる [MENEZES].

source: Some servers may wish to permit user authentication to proceed even when the negotiated GSS-API context does not support per-message integrity protection.
ja: 交渉済みの GSS-API コンテキストが メッセージ単位の完全性保護をサポートしていない場合でも, ユーザ認証を進めることをサーバが許可する場合がある.

source: Upon completion of the key exchange protocol, all further secure shell traffic is parsed into a data structure known as a secure shell binary packet as shown below in Figure 2 (see also Section 6 of [RFC4253]).
ja: 鍵交換プロトコルが完了すると, それ以後のセキュアシェルの通信は, 以下の図2で示す (また [RFC4253] の6節を参照) セキュアシェルバイナリパケットとして知られるデータ構造に構文解析される.

source: Algorithm Negotiation
ja: アルゴリズムのネゴシエーション

source: Conventions for Names .
ja: 命名規則 .

source: The goal is to make it impossible to find valid usernames by comparing the results when authenticating as different users.
ja: この目的は, 異なるユーザで認証する時の結果を比較して有効なユーザ名を探すのを困難にするためだ.

source: Conventions .
ja: 規約 .

source: This document describes authentication and key-exchange protocols.
ja: この文書は認証と鍵交換プロトコルを記述している.

source: When the network is not under stress, the Transport Model and its underlying security mechanisms MAY depend upon the ready availability of other network services.
ja: ネットワークに負荷がかかっていない時に, トランスポートモデルとその基底のセキュリティメカニズムは, 他のネットワークサービスがすぐに利用できるかどうかに依存してもよい.

source: The server may go into a sleep period after repeated unsuccessful authentication attempts to make key search more difficult for attackers.
ja: 攻撃者にとって鍵の探索をより難しくするために, 認証の不成功が繰り返されたらサーバは休眠期間に入ってもよい

source: Implementers SHOULD provide mechanisms for administrators to control which services are exposed to limit the vulnerability of other services.
ja: 実装者は, サービスの弱点をさらさないためにどのサービスを公開するかを管理者が制御するメカニズムを提供する必要がある.

source: This is facilitated by the following notification.
ja: これは次の告知によって促進される.

source: The user's public signing key MUST be the signing key conveyed in the X.509v3 certificate sent in the first SSH_MSG_USERAUTH_REQUEST message.
ja: ユーザの公開署名鍵は, 最初の SSH_MSG_USERAUTH_REQUEST メッセージで送られる X.509v3 証明書で伝達される署名鍵でなければならない.

source: Implementers SHOULD allow system administrators to disable some curves, including REQUIRED or RECOMMENDED curves, to meet local security policy.
ja: 実装者は, 必須や推奨の曲線を含むいくつかの曲線をシステム管理者がローカルなセキュリティポリシーを充たすために無効にするのを許可する必要がある.

source: IANA is also requested to assign "netconf" as an SSH Service Name as defined in [RFC4250], as follows:
ja: IANA は, [RFC4250] で定義された SSH Service Name として, 以下のように "netconf" を割り当てるよう要求された.

source: 3) The packet_length cannot be decrypted until the tag has been verified.
ja: 3) タグが検証されるまで packet_length が復号できない.

source: Protocol extensions using K directly should be viewed with extreme suspicion.
ja: K を直接用いるプロトコルの拡張は, 非常な疑念も持って見る必要がある.

source: The "twofish192-ctr" method uses Twofish with 192-bit keys.
ja: "twofish192-ctr" は 192-bit 鍵を用いる Twofish を使う.

source: The IANA considerations for the SSH protocol as defined in [SSH-ARCH], [SSH-TRANS], [SSH-USERAUTH], and this document, are detailed in [SSH-NUMBERS].
ja: [SSH-ARCH], [SSH-TRANS], [SSH-USERAUTH] とこの文書で定義される SSH プロトコルに対する IANA の考慮は, [SSH-NUMBERS] で詳述されている.

source: The value of 'partial success' MUST be TRUE if the authentication request to which this is a response was successful.
ja: 'partial success' の値は, 対応する認証の要求が成功した場合に TRUE でなければならない.

source: C then computes K = f^x mod p, H = hash(V_C || V_S || I_C || I_S || K_S || min || n || max || p || g || e || f || K), and verifies the signature s on H.
ja: そして C は K = f^x mod p と H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K)を計算し H に対する署名 s を検証する.

source: o All algorithms are negotiated, and in case some algorithm is broken, it is easy to switch to some other algorithm without modifying the base protocol.
ja: o すべてのアルゴリズムは取り決められる(ネゴシエーションされる). また, アルゴリズムが破られた場合, ベースのプロトコルを変更せずに他のアルゴリズムに簡単に変更できる.

source: Instead of sending "min || n || max", the client only sends "n".
ja: "min || n || max" を送る代わりに クライアントは "n" のみを送る.

source: Passive monitoring of any protocol may give an attacker some information about the session, the user, or protocol specific information that they would otherwise not be able to garner.
ja: あらゆるプロトコルに対する受動的なモニタリングは, 攻撃者にセッションやユーザについての情報や, それ以外では集められないプロトコル特有の情報を与える場合がある.

source: While the SSH and USM specifications frequently refer to a user, the terminology preferred in [RFC3411] and in this memo is "principal".
ja: SSH と USM の仕様は頻繁にユーザという用語を参照するが, [RFC3411] とこのメモで好む用語は "principal" だ.

source: 36 ICRNL Map CR to NL on input.
ja: 36 ICRNL 入力でCRをNLに置き換える.

source: All fields SHOULD be presented to the user.
ja: すべてのフィールドがユーザに表示される必要がある.

source: The server then requests authentication information from the client with an SSH_MSG_USERAUTH_INFO_REQUEST message.
ja: そしてサーバは, クライアントからの認証情報を SSH_MSG_USERAUTH_INFO_REQUEST で要求する.

source: Client Acknowledgement ....................................16 3.7.
ja: クライアントの確認応答 ....................................16 3.7.

source: If password authentication is used, servers SHOULD provide a configuration option to disable the use of password authentication after the first public key is added.
ja: パスワード認証が使える場合, 最初の公開鍵が追加された後でパスワード認証の利用を無効にする設定項目をサーバは提供する必要がある.

source: This document formally documents an existing public key file format in use for exchanging public keys between different Secure Shell (SSH) implementations.
ja: この文書は, 異なるセキュアシェル(SSH) 実装間で公開鍵を交換するために, 現在利用されている公開鍵ファイル形式を公式に説明する.

source: Use of the Packet Sequence Number in the AT
ja: AT でのパケットシーケンス番号の利用

source: Control Character Filtering
ja: 制御文字のフィルタリング

source: From this, the attacker will not be able to make this attack work since the attacker will not be able to correctly sign packets containing this session-specific data from the server, since he does not have the private key of that server.
ja: これにより, 攻撃者にはサーバからのセッション固有のデータを含むパケットに正しく署名できない(秘密鍵を持っていないから)ので, 攻撃できない.

source: For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].
ja: 現在の Internet-Standard Management Framework を記述する文書の詳細な概要は, RFC 3410 [RFC3410] の7節を参照せよ.

source: Ensuring that these counters are properly implemented is crucial to the security of the system.
ja: これらのカウンタが適切に実装されていることの保証は, システムのセキュリティにとって重大だ.

source: "Transport Subsystem for the Simple Network Management Protocol" [RFC5590] defines general requirements for caches and references.
ja: "Transport Subsystem for the Simple Network Management Protocol" [RFC5590] は, キャッシュとリファレンスについての一般的な要求を定義している.

source: Notification Authorization Considerations .................31 9.3.
ja: 通知の認可の考察 .................31 9.3.

source: In more detail, an adversary looks for a collision between the MACs associated to two packets that were MACed with the same 32-bit sequence number (see Section 4.4 of [RFC4253]).
ja: より詳細には, 同じ 32-bitシーケンス番号([RFC 4253] の 4.4節) でMACされた2つのパケットのMACの衝突を探す.

source: This case is handled the same way that key exchange methods requiring encryption/signature capable public key algorithms are
ja: [RFC4253]の 7.1 節での 暗号化/署名可能な公開鍵アルゴリズムを必要とする鍵交換法が扱われるのと同じように, この場合も扱われる.

source: Channel Bindings ..........................................22 7.3.
ja: チャンネルの束縛 ..........................................22 7.3.

source: A previous version of the SSH protocol, described in [SSH1], uses a key-exchange method based on Rivest-Shamir-Adleman (RSA) public-key encryption, which consumes an order of magnitude less CPU time on the client, and hence is particularly suitable for slow client systems such as mobile devices.
ja: [SSH1] で記述されているSSHプロトコルの以前のバージョンでは, Rivest-Shamir-Adleman (RSA) 公開鍵暗号をベースとする鍵交換法を利用している. これは, クライアントでのCPU時間の消費が1ケタ少なく, モバイルデバイスのような遅いクライアントシステムに特に適している.

source: In accordance with Section 4.2.1.3 of [RFC5280], if the KeyUsage extension is present, then the certificate MUST be used only for one of the purposes indicated.
ja: KeyUsage 拡張が存在するなら, [RFC5280] の 4.2.1.3 節に従い, 証明書は, 指定された目的の1つにのみ利用されなければならない.

source: Section 7.1 addresses how this goal is to be achieved in secure shell.
ja: 7.1節で, セキュアシェルでこの目標をどう達成するかを説明する.

source: Two references that may provide information on the subject are [SCHNEIER] and [KAUFMAN].
ja: この件で情報を提供してくれる2つの文献が [SCHNEIER] と [KAUFMAN] だ.

source: ECDH Key Exchange
ja: ECDH 鍵交換

source: In an implementation-specific manner, invoke the SSH user- authentication service using the calculated user name.
ja: 実装依存の方法で, 算出されたユーザ名を用いて SSH ユーザ認証サービスを起動する.
